In [1]:
from pandas import DataFrame
df = DataFrame(
              [
                  [19,14,18,19],
                  [18,10,17,16],
                  [17,16,18,15]
              ]
    ,columns=['OSA','JAVA','SE','DS']
             )
df

   OSA  JAVA  SE  DS
0   19    14  18  19
1   18    10  17  16
2   17    16  18  15

In [3]:
df.sum()

OSA     54
JAVA    40
SE      53
DS      50
dtype: int64

In [5]:
df.max()

OSA     19
JAVA    16
SE      18
DS      19
dtype: int64

In [6]:
df.min()

OSA     17
JAVA    10
SE      17
DS      15
dtype: int64

In [7]:
df.mean()

OSA     18.000000
JAVA    13.333333
SE      17.666667
DS      16.666667
dtype: float64

In [8]:
df.count()

OSA     3
JAVA    3
SE      3
DS      3
dtype: int64

In [12]:
df.size()

TypeError: 'numpy.int32' object is not callable

In [13]:
df.first()

TypeError: first() missing 1 required positional argument: 'offset'

In [14]:
df.last()

TypeError: last() missing 1 required positional argument: 'offset'

In [15]:
df.describe()

        OSA       JAVA         SE         DS
count   3.0   3.000000   3.000000   3.000000
mean   18.0  13.333333  17.666667  16.666667
std     1.0   3.055050   0.577350   2.081666
min    17.0  10.000000  17.000000  15.000000
25%    17.5  12.000000  17.500000  15.500000
50%    18.0  14.000000  18.000000  16.000000
75%    18.5  15.000000  18.000000  17.500000
max    19.0  16.000000  18.000000  19.000000

In [17]:
df.agg(['sum','max','min','std'])

      OSA      JAVA        SE         DS
sum  54.0  40.00000  53.00000  50.000000
max  19.0  16.00000  18.00000  19.000000
min  17.0  10.00000  17.00000  15.000000
std   1.0   3.05505   0.57735   2.081666

In [18]:
df.prod()

OSA     5814
JAVA    2240
SE      5508
DS      4560
dtype: int64

In [19]:
df.median()

OSA     18.0
JAVA    14.0
SE      18.0
DS      16.0
dtype: float64

In [30]:
from pandas import DataFrame
df1 = DataFrame(
              [
                  ['Shridhar','Havinal','Full-time','administration',2,20000],
                  ['Omkar','Sharanarthi','intern','technical',1,5000],
                  ['Rahul','Badakuri','Full-time','administration',5,10000],
                  ['Shivanand','Pujari','part-time','technical',3,10000],
                  ['Santosh','Hanjagi','Full-time','Management',6,20000]
              ]
    ,columns=['First Name','Last Name','Type','Department','YoE','salary']
              )
df1

  First Name    Last Name       Type      Department  YoE  salary
0   Shridhar      Havinal  Full-time  administration    2   20000
1      Omkar  Sharanarthi     intern       technical    1    5000
2      Rahul     Badakuri  Full-time  administration    5   10000
3  Shivanand       Pujari  part-time       technical    3   10000
4    Santosh      Hanjagi  Full-time      Management    6   20000

In [31]:
df1.groupby(['Type']).sum()

           YoE  salary
Type
Full-time   13   50000
intern       1    5000
part-time    3   10000

In [32]:
df1.groupby(['Type']).mean()

                YoE        salary
Type
Full-time  4.333333  16666.666667
intern     1.000000   5000.000000
part-time  3.000000  10000.000000

In [33]:
df1.groupby(['Type','Department']).sum()

                          YoE  salary
Type      Department
Full-time Management        6   20000
          administration    7   30000
intern    technical         1    5000
part-time technical         3   10000

In [34]:
df1.groupby(['Department','Type']).sum()

                          YoE  salary
Department     Type
Management     Full-time    6   20000
administration Full-time    7   30000
technical      intern       1    5000
               part-time    3   10000

In [38]:
df1.groupby(['salary']).sum()

        YoE
salary
5000      1
10000     8
20000     8

In [39]:
df1.groupby(['salary']).prod()

        YoE
salary
5000      1
10000    15
20000    12